app/Controllers/film.php

UPDATE `listFilm` SET `rate` = 8.5
WHERE `id` = '1'
---
    public function show()
    {
        $data = $this->model->findAll();
        if ($data) {
            // array multi-dimensi
            $index=0;
            $dataFilm = array();
            foreach ($data as $d) {
                $data[$index] = [
                    'id' => $d['id'],
                    'judul' => $d['judul'],
                    'slug' => $d['slug'],
                    'sampul' => $d['sampul'],
                    'genre' => $d['genre'],
                    'actor' => $d['actor'],
                    'negara' => $d['negara'],
                    'sutradara' => $d['sutradara'],
                    'storyline' => $d['storyline'],
                    'rate' => $d['rate'],
                    'tahunTerbit' => $d['tahunTerbit'],
                    'status' => $d['status'],
                ];
                $db      = \Config\Database::connect();
                $builder = $db->table('listFilm');
                if ($this->rate($d['id'])!="") {
                    $builder->set('rate', $this->rate($d['id']));
                    $builder->where('id', $d['id']);
                    $builder->update();